<?php
echo '<h2 class="title">Задача 3.</h2>';
echo '<p>Создайте скрипт PHP, который отображает название столицы и страны из указанного выше массива $ceu. Сортировать список по столице страны.</p>';
$ceu = array( "Италия"=>"Рим", "Люксембург"=>"Люксембург",
"Бельгия"=>"Брюссель", "Дания"=>"Копенгаген",
"Финляндия" => "Хельсинки", "Франция" => "Париж",
"Словакия"=>"Братислава", "Словения"=>"Любляна",
"Германия" => "Берлин", "Греция" => "Афины",
"Ирландия"=>"Дублин", "Нидерланды"=>"Амстердам",
"Португалия"=>"Лиссабон", "Испания"=>"Мадрид",
"Швеция"=>"Стокгольм", "Великобритания"=>"Лондон",
"Кипр"=>"Никосия", "Литва"=>"Вильнюс",
"Чехия"=>"Прага", "Эстония"=>"Таллин",
"Венгрия"=>"Будапешт", "Латвия"=>"Рига","Мальта"=>"Валетта",
"Австрия" => "Вена", "Польша" => "Варшава") ;
asort($ceu);
echo "<p>Ответ: </p>";
echo "<ul>";
foreach($ceu as $country => $capital) {
    echo "<li>$country - $capital.</li>";
    
};
echo "</ul>";
?>
